Repository: zeroy1024/Swift-Craft-Launcher
Catalog: SwiftCraftLauncher/Resources/Localizable.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, hi, it, ja, ko, nb, nl, pl, pt, ru, sv, th, tr, vi, zh_hans, zh_hant

# skin.library.delete.history.message
source: This will permanently delete "%@" from the local skin library. This action cannot be undone.
ar: سيؤدي هذا إلى حذف "%@" نهائيًا من مكتبة السكنات المحلية. لا يمكن التراجع عن هذا الإجراء.
da: Dette vil permanent slette "%@" fra det lokale skin-bibliotek. Denne handling kan ikke fortrydes.
de: Dadurch wird "%@" dauerhaft aus der lokalen Skin-Bibliothek gelöscht. Diese Aktion kann nicht rückgängig gemacht werden.
es: Esto eliminará permanentemente "%@" de la biblioteca local de skins. Esta acción no se puede deshacer.
fi: Tämä poistaa kohteen "%@" pysyvästi paikallisesta skin-kirjastosta. Tätä toimintoa ei voi kumota.
fr: Cela supprimera définitivement "%@" de la bibliothèque locale de skins. Cette action est irréversible.
hi: यह "%@" को स्थानीय स्किन लाइब्रेरी से स्थायी रूप से हटा देगा। इस क्रिया को पूर्ववत नहीं किया जा सकता।
it: Questo eliminerà definitivamente "%@" dalla libreria skin locale. Questa azione non può essere annullata.
ja: これにより "%@" はローカルスキンライブラリから完全に削除されます。この操作は元に戻せません。
ko: 이 작업은 "%@"을(를) 로컬 스킨 라이브러리에서 영구적으로 삭제합니다. 이 작업은 되돌릴 수 없습니다.
nb: Dette vil slette "%@" permanent fra det lokale skin-biblioteket. Denne handlingen kan ikke angres.
nl: Hiermee wordt "%@" permanent verwijderd uit de lokale skinbibliotheek. Deze actie kan niet ongedaan worden gemaakt.
pl: Spowoduje to trwałe usunięcie "%@" z lokalnej biblioteki skinów. Tej akcji nie można cofnąć.
pt: Isso excluirá "%@" permanentemente da biblioteca local de skins. Esta ação não pode ser desfeita.
ru: Это навсегда удалит "%@" из локальной библиотеки скинов. Это действие нельзя отменить.
sv: Detta kommer att permanent radera "%@" från det lokala skin-biblioteket. Denna åtgärd kan inte ångras.
th: การดำเนินการนี้จะลบ "%@" ออกจากคลังสกินภายในเครื่องอย่างถาวร และไม่สามารถยกเลิกได้
tr: Bu işlem "%@" öğesini yerel skin kitaplığından kalıcı olarak siler. Bu işlem geri alınamaz.
vi: Thao tác này sẽ xóa vĩnh viễn "%@" khỏi thư viện skin cục bộ. Hành động này không thể hoàn tác.
zh_hans: 这将从本地皮肤库中永久删除“%@”。此操作无法撤销。
zh_hant: 這將從本地皮膚庫中永久刪除「%@」。此操作無法復原。

# skin.library.delete.history.title
source: Delete skin history?
ar: حذف سجل السكنات؟
da: Slet skinhistorik?
de: Skin-Verlauf löschen?
es: ¿Eliminar historial de skins?
fi: Poistetaanko skin-historia?
fr: Supprimer l'historique des skins ?
hi: स्किन इतिहास हटाएं?
it: Eliminare cronologia skin?
ja: スキン履歴を削除しますか？
ko: 스킨 기록을 삭제하시겠습니까?
nb: Slette skinhistorikk?
nl: Skingeschiedenis verwijderen?
pl: Usunąć historię skinów?
pt: Excluir histórico de skins?
ru: Удалить историю скинов?
sv: Radera skinhistorik?
th: ลบประวัติสกินหรือไม่?
tr: Skin geçmişi silinsin mi?
vi: Xóa lịch sử skin?
zh_hans: 删除皮肤历史记录？
zh_hant: 刪除皮膚歷史記錄？

# skin.library.title
source: Skin History Library
ar: مكتبة سجل السكنات
da: Skinhistorik-bibliotek
de: Skin-Verlaufsbibliothek
es: Biblioteca del historial de skins
fi: Skin-historiakirjasto
fr: Bibliothèque d'historique des skins
hi: स्किन इतिहास लाइब्रेरी
it: Libreria cronologia skin
ja: スキン履歴ライブラリ
ko: 스킨 기록 라이브러리
nb: Skinhistorikk-bibliotek
nl: Skingeschiedenisbibliotheek
pl: Biblioteka historii skinów
pt: Biblioteca de histórico de skins
ru: Библиотека истории скинов
sv: Skinhistorikbibliotek
th: คลังประวัติสกิน
tr: Skin Geçmişi Kitaplığı
vi: Thư viện lịch sử skin
zh_hans: 历史皮肤库
zh_hant: 歷史皮膚庫

source: Skin Manager
ar: مدير المظهر
es: Administrador de Skins
fi: Skin-hallinta
fr: Gestionnaire de Skins
hi: स्किन प्रबंधक
it: Gestore Skin
ja: スキンマネージャー
ko: 스킨 관리자
nl: Skin Beheerder
pl: Menedżer Skórek
pt: Gerenciador de Skins
ru: Менеджер Скинов
th: ตัวจัดการสกิน
tr: Skin Yöneticisi
vi: Trình quản lý Skin
zh_hans: 皮肤管理器
zh_hant: 皮膚管理器

# skin.no_cape
source: No Cape
ar: بدون عباءة
da: Ingen Kappe
de: Kein Umhang
es: Sin Capa
fi: Ei Viittaa
fr: Pas de Cape
hi: कोई केप नहीं
it: Nessun Mantello
ja: ケープなし
ko: 망토 없음
nb: Ingen Kappe
nl: Geen Cape
pl: Brak Peleryny
pt: Sem Capa
ru: Без Плаща
sv: Ingen Kappa
th: ไม่มีผ้าคลุม
tr: Pelerin Yok
vi: Không có Áo choàng
zh_hans: 无斗篷
zh_hant: 無斗篷

# skin.no_capes_available
source: No capes available
ar: لا توجد عباءات متاحة
da: Ingen kapper tilgængelige
de: Keine Umhänge verfügbar
es: No hay capas disponibles
fi: Ei viittoja saatavilla
fr: Aucune cape disponible
hi: कोई केप उपलब्ध नहीं
it: Nessun mantello disponibile
ja: 利用可能なケープがありません
ko: 사용 가능한 망토가 없습니다
nb: Ingen kapper tilgjengelige
nl: Geen capes beschikbaar
pl: Brak dostępnych peleryn
pt: Nenhuma capa disponível
ru: Нет доступных плащей
sv: Inga kappor tillgängliga
th: ไม่มีผ้าคลุมให้ใช้
tr: Kullanılabilir pelerin yok
vi: Không có áo choàng nào
zh_hans: 没有可用的斗篷
zh_hant: 沒有可用的斗篷

# skin.no_player
source: No Player Selected
ar: لم يتم اختيار لاعب
da: Ingen spiller valgt
de: Kein Spieler ausgewählt
es: Ningún Jugador Seleccionado
fi: Ei pelaajaa valittu
fr: Aucun Joueur Sélectionné
hi: कोई खिलाड़ी चयनित नहीं
it: Nessun Giocatore Selezionato
ja: プレイヤーが選択されていません
ko: 선택된 플레이어 없음
nb: Ingen spiller valgt
nl: Geen speler geselecteerd
pl: Nie wybrano gracza
pt: Nenhum Jogador Selecionado
ru: Игрок не выбран
sv: Ingen spelare vald
th: ไม่ได้เลือกผู้เล่น
tr: Oyuncu Seçilmedi
vi: Chưa chọn người chơi
zh_hans: 未选择玩家
zh_hant: 未選擇玩家

source: Skin Preview
ar: معاينة المظهر
da: Skin Forhåndsvisning
de: Skin-Vorschau
es: Vista Previa de Skin
fi: Skin-esikatselu
fr: Aperçu du Skin
hi: स्किन पूर्वावलोकन
it: Anteprima Skin
ja: スキンプレビュー
ko: 스킨 미리보기
nb: Skin Forhåndsvisning
nl: Skin Voorvertoning
pl: Podgląd Skórki
pt: Pré-visualização de Skin
ru: Предпросмотр Скина
sv: Skin Förhandsvisning
th: ตัวอย่างสกิน
tr: Skin Önizleme
vi: Xem trước Skin
zh_hans: 皮肤预览
zh_hant: 皮膚預覽

# skin.reset
source: Reset Skin
ar: إعادة تعيين المظهر
da: Nulstil Skin
de: Skin zurücksetzen
es: Restablecer Skin
fi: Palauta Skin
fr: Réinitialiser Skin
hi: स्किन रीसेट करें
it: Ripristina Skin
ja: スキンをリセット
ko: 스킨 재설정
nb: Tilbakestill Skin
nl: Skin Resetten
pl: Resetuj Skórkę
pt: Redefinir Skin
ru: Сбросить Скин
sv: Återställ Skin
th: รีเซ็ตสกิน
tr: Skin'i Sıfırla
vi: Đặt lại Skin
zh_hans: 重置皮肤
zh_hant: 重置皮膚

# skin.slim
source: Slim
ar: رفيع
da: Smal
de: Schlank
es: Delgado
fi: Ohut
fr: Mince
hi: पतला
it: Sottile
ja: スリム
ko: 슬림
nb: Smal
nl: Slank
pt: Magro
ru: Тонкий
sv: Smal
th: ผอม
tr: İnce
vi: Mảnh
zh_hans: 纤细
zh_hant: 纖細

# skin.title
source: Skin
ar: المظهر
hi: स्किन
ja: スキン
ko: 스킨
pl: Skórka
ru: Скин
th: สกิน
zh_hans: 皮肤
zh_hant: 皮膚

source: Skin Upload
ar: رفع المظهر
de: Skin hochladen
es: Subir Skin
fi: Skin-lataus
fr: Télécharger Skin
hi: स्किन अपलोड
it: Carica Skin
ja: スキンアップロード
ko: 스킨 업로드
nb: Skin Opplasting
nl: Skin Uploaden
pl: Prześlij Skórkę
pt: Carregar Skin
ru: Загрузка Скина
sv: Skin Uppladdning
th: อัปโหลดสกิน
tr: Skin Yükle
vi: Tải lên Skin
zh_hans: 皮肤上传
zh_hant: 皮膚上傳

# startup.info.understand
source: I Understand
ar: فهمت
da: Jeg forstår
de: Verstanden
es: Entiendo
fi: Ymmärrän
fr: Je comprends
hi: समझ गया
it: Capisco
ja: 理解しました
ko: 이해했습니다
nb: Jeg forstår
nl: Ik begrijp het
pl: Rozumiem
pt: Entendo
ru: Понятно
sv: Jag förstår
th: เข้าใจแล้ว
tr: Anladım
vi: Tôi hiểu
zh_hans: 我知道了
zh_hant: 我知道了

# stop.fill
source: Stop
ar: إيقاف
de: Stoppen
es: Detener
fi: Pysäytä
fr: Arrêter
hi: रोकें
it: Ferma
ja: 停止
ko: 중지
nb: Stopp
pl: Zatrzymaj
pt: Parar
ru: Остановить
sv: Stoppa
th: หยุด
tr: Durdur
vi: Dừng
zh_hans: 停止
zh_hant: 停止

# version.directory.tree
source: Versions directory tree
ar: شجرة مجلد الإصدارات
da: Versionsmappetræ
de: Versionsordnerstruktur
es: Árbol del directorio de versiones
fi: Versiohakemiston puu
fr: Arborescence du dossier des versions
hi: संस्करण निर्देशिका वृक्ष
it: Struttura della cartella delle versioni
ja: バージョンディレクトリツリー
ko: 버전 디렉터리 트리
nb: Versjonsmappetre
nl: Versiemappenstructuur
pl: Drzewo katalogu wersji
pt: Árvore do diretório de versões
ru: Дерево каталога версий
sv: Versionsmappträd
th: แผนผังโฟลเดอร์เวอร์ชัน
tr: Sürüm dizini ağacı
vi: Cây thư mục phiên bản
zh_hans: 版本目录树
zh_hant: 版本目錄樹

# yggdrasil.auth.method
source: Login Method
ar: طريقة تسجيل الدخول
da: Loginmetode
de: Anmeldemethode
es: Método de inicio de sesión
fi: Kirjautumistapa
fr: Méthode de connexion
hi: लॉगिन विधि
it: Metodo di accesso
ja: ログイン方法
ko: 로그인 방식
nb: Påloggingsmetode
nl: Inlogmethode
pl: Metoda logowania
pt: Método de login
ru: Способ входа
sv: Inloggningsmetod
th: วิธีเข้าสู่ระบบ
tr: Giriş yöntemi
vi: Phương thức đăng nhập
zh_hans: 登录方式
zh_hant: 登入方式

# yggdrasil.auth.method.password
source: Password
ar: كلمة المرور
da: Adgangskode
de: Passwort
es: Contraseña
fi: Salasana
fr: Mot de passe
hi: पासवर्ड
ja: パスワード
ko: 비밀번호
nb: Passord
nl: Wachtwoord
pl: Hasło
pt: Senha
ru: Пароль
sv: Lösenord
th: รหัสผ่าน
tr: Parola
vi: Mật khẩu
zh_hans: 用户名密码
zh_hant: 使用者名稱密碼

# yggdrasil.auth.password
source: Password
ar: كلمة المرور
da: Adgangskode
de: Passwort
es: Contraseña
fi: Salasana
fr: Mot de passe
hi: पासवर्ड
ja: パスワード
ko: 비밀번호
nb: Passord
nl: Wachtwoord
pl: Hasło
pt: Senha
ru: Пароль
sv: Lösenord
th: รหัสผ่าน
tr: Parola
vi: Mật khẩu
zh_hans: 密码
zh_hant: 密碼

# common.add
source: Add
ar: إضافة
da: Tilføj
de: Hinzufügen
es: Añadir
fi: Lisää
fr: Ajouter
hi: जोड़ें
it: Aggiungi
ja: 追加
ko: 추가
nb: Legg til
nl: Toevoegen
pl: Dodaj
pt: Adicionar
ru: Добавить
sv: Lägg till
th: เพิ่ม
tr: Ekle
vi: Thêm
zh_hans: 添加
zh_hant: 新增

# yggdrasil.auth.remember_password
source: Remember Password
ar: تذكر كلمة المرور
da: Husk adgangskode
de: Passwort merken
es: Recordar contraseña
fi: Muista salasana
fr: Mémoriser le mot de passe
hi: पासवर्ड याद रखें
it: Ricorda password
ja: パスワードを記憶
ko: 비밀번호 기억
nb: Husk passord
nl: Wachtwoord onthouden
pl: Zapamiętaj hasło
pt: Lembrar senha
ru: Запомнить пароль
sv: Kom ihåg lösenord
th: จดจำรหัสผ่าน
tr: Şifreyi hatırla
vi: Ghi nhớ mật khẩu
zh_hans: 记住密码
zh_hant: 記住密碼

# yggdrasil.auth.processing
source: Getting player info…
ar: جارٍ جلب معلومات اللاعب…
da: Henter spilleroplysninger…
de: Spielerinformationen werden abgerufen …
es: Obteniendo información del jugador…
fi: Haetaan pelaajatietoja…
fr: Récupération des informations du joueur…
hi: खिलाड़ी की जानकारी प्राप्त की जा रही है…
it: Recupero delle informazioni del giocatore…
ja: プレイヤー情報を取得しています…
ko: 플레이어 정보를 가져오는 중…
nb: Henter spillerinformasjon…
nl: Spelerinformatie wordt opgehaald…
pl: Pobieranie informacji o graczu…
pt: Obtendo informações do jogador…
ru: Получение информации об игроке…
sv: Hämtar spelarinfo…
th: กำลังดึงข้อมูลผู้เล่น…
tr: Oyuncu bilgileri alınıyor…
vi: Đang lấy thông tin người chơi…
zh_hans: 正在获取玩家信息…
zh_hant: 正在取得玩家資訊…

# yggdrasil.auth.ready
source: Skin server selected, you can start sign-in now
ar: تم اختيار خادم الجلد، يمكنك البدء بتسجيل الدخول الآن
da: Skinsserver valgt, du kan nu starte login
de: Skin-Server ausgewählt, Sie können sich jetzt anmelden
es: Servidor de skins seleccionado, ahora puedes iniciar sesión
fi: Skini-palvelin valittu, voit nyt aloittaa kirjautumisen
fr: Serveur de skins sélectionné, vous pouvez maintenant commencer la connexion
hi: स्किन सर्वर चुना जा चुका है, अब आप लॉगिन शुरू कर सकते हैं
it: Server delle skin selezionato, puoi ora iniziare l'accesso
ja: スキンサーバーが選択されました。ログインを開始できます
ko: 스킨 서버가 선택되었습니다。 이제 로그인할 수 있습니다。
nb: Skintjener valgt, du kan nå starte innlogging
nl: Skinserver geselecteerd, je kunt nu inloggen
pl: Serwer skórek wybrany, możesz rozpocząć logowanie
pt: Servidor de skins selecionado, você já pode iniciar o login
ru: Сервер скинов выбран, можно начинать вход
sv: Skinserver vald, du kan nu börja inloggningen
th: เลือกเซิร์ฟเวอร์สกินแล้ว คุณสามารถเริ่มเข้าสู่ระบบได้
tr: Skin sunucusu seçildi, şimdi oturum açmaya başlayabilirsiniz
vi: Máy chủ skin đã được chọn, bạn có thể bắt đầu đăng nhập
zh_hans: 已选择皮肤站，可开始登录
zh_hant: 已選擇皮膚站，可開始登入

# yggdrasil.auth.ready.subtitle
source: Use the button below to open the browser.
ar: استخدم الزر أدناه لفتح المتصفح.
da: Brug knappen nedenfor for at åbne browseren.
de: Verwenden Sie die Schaltfläche unten, um den Browser zu öffnen.
es: Utiliza el botón de abajo para abrir el navegador.
fi: Käytä alla olevaa painiketta avataksesi selaimen.
fr: Utilisez le bouton ci-dessous pour ouvrir le navigateur.
hi: ब्राउज़र खोलने के लिए नीचे दिए गए बटन का उपयोग करें।
it: Usa il pulsante qui sotto per aprire il browser.
ja: 下のボタンを使ってブラウザを開いてください。
ko: 아래 버튼을 눌러 브라우저를 여세요。
nb: Bruk knappen nedenfor for å åpne nettleseren.
nl: Gebruik de knop hieronder om de browser te openen.
pl: Użyj przycisku poniżej, aby otworzyć przeglądarkę.
pt: Use o botão abaixo para abrir o navegador.
ru: Используйте кнопку ниже, чтобы открыть браузер.
sv: Använd knappen nedan för att öppna webbläsaren.
th: ใช้ปุ่มด้านล่างเพื่อเปิดเบราว์เซอร์
tr: Tarayıcıyı açmak için aşağıdaki düğmeyi kullanın.
vi: Sử dụng nút bên dưới để mở trình duyệt.
zh_hans: 点击下方按钮在浏览器中完成登录。
zh_hant: 點擊下方按鈕在瀏覽器中完成登入。

# yggdrasil.auth.username
source: Username or Email
ar: اسم المستخدم أو البريد الإلكتروني
da: Brugernavn eller e-mail
de: Benutzername oder E-Mail
es: Nombre de usuario o correo
fi: Käyttäjänimi tai sähköposti
fr: Nom d'utilisateur ou e-mail
hi: उपयोगकर्ता नाम या ईमेल
it: Nome utente o e-mail
ja: ユーザー名またはメール
ko: 사용자 이름 또는 이메일
nb: Brukernavn eller e-post
nl: Gebruikersnaam of e-mail
pl: Nazwa użytkownika lub e-mail
pt: Nome de usuário ou e-mail
ru: Имя пользователя или email
sv: Användarnamn eller e-post
th: ชื่อผู้ใช้หรืออีเมล
tr: Kullanıcı adı veya e-posta
vi: Tên người dùng hoặc email
zh_hans: 用户名或邮箱
zh_hant: 使用者名稱或電子郵件

# yggdrasil.auth.waiting_browser
source: Complete sign-in in browser
ar: في انتظار إكمال تسجيل الدخول في المتصفح
da: Venter på, at login fuldføres i browseren
de: Warten darauf, dass die Anmeldung im Browser abgeschlossen wird
es: Completa el inicio de sesión en el navegador
fi: Viimeistele kirjautuminen selaimessa
fr: Terminez la connexion dans le navigateur
hi: कृपया ब्राउज़र में लॉगिन प्रक्रिया पूरी करें
it: Completa l'accesso nel browser
ja: ブラウザでサインインを完了してください
ko: 브라우저에서 로그인을 완료하세요
nb: Fullfør innloggingen i nettleseren
nl: Maak het inloggen af in de browser
pl: Dokończ logowanie w przeglądarce
pt: Conclua o login no navegador
ru: Завершите вход в браузере
sv: Slutför inloggningen i webbläsaren
th: กรุณาเสร็จสิ้นการเข้าสู่ระบบในเบราว์เซอร์
tr: Lütfen tarayıcıda oturum açmayı tamamlayın
vi: Vui lòng hoàn tất đăng nhập trong trình duyệt
zh_hans: 请在浏览器中完成登录授权
zh_hant: 請在瀏覽器中完成登入授權

# yggdrasil.auth.waiting_browser.subtitle
source: Return to this app when done.
ar: بعد الانتهاء في المتصفح، عد إلى هذا التطبيق.
da: Når du er færdig i browseren, skal du vende tilbage til denne app.
de: Kehren Sie nach Abschluss im Browser zu dieser App zurück.
es: Vuelve a esta aplicación cuando termines.
fi: Palaa tähän sovellukseen, kun olet valmis.
fr: Revenez dans cette application une fois terminé.
hi: पूरा होने पर कृपया इस ऐप पर वापस आएं।
it: Quando hai finito nel browser, torna a questa app.
ja: ブラウザでの操作が完了したら、このアプリに戻ってください。
ko: 브라우저에서 완료한 후 이 앱으로 돌아오세요。
nb: Gå tilbake til denne appen når du er ferdig.
nl: Keer terug naar deze app wanneer je klaar bent.
pl: Wróć do tej aplikacji po zakończeniu.
pt: Volte para este app quando terminar.
ru: После завершения в браузере вернитесь в это приложение.
sv: Återvänd till den här appen när du är klar.
th: เมื่อเสร็จแล้วให้กลับมาที่แอปนี้
tr: İşiniz bittiğinde bu uygulamaya geri dönün.
vi: Quay lại ứng dụng này khi hoàn tất.
zh_hans: 完成后请回到本应用。
zh_hant: 完成後請回到本應用。

# yggdrasil.error.build_authorize_url_failed
source: Failed to build authorization URL. Please check server configuration.
ar: تعذّر إنشاء عنوان URL للتفويض، يرجى التحقق من إعدادات الخادم.
da: Kunne ikke oprette godkendelses-URL. Kontroller serverkonfigurationen.
de: Die Autorisierungs-URL konnte nicht erstellt werden. Bitte überprüfe die Serverkonfiguration.
es: No se pudo crear la URL de autorización. Verifica la configuración del servidor.
fi: Valtuutusosoitteen luominen epäonnistui. Tarkista palvelimen asetukset.
fr: Échec de la création de l’URL d’autorisation. Veuillez vérifier la configuration du serveur.
hi: प्राधिकरण URL बनाने में विफल। कृपया सर्वर कॉन्फ़िगरेशन जाँचें।
it: Impossibile creare l’URL di autorizzazione. Controlla la configurazione del server.
ja: 認可URLの生成に失敗しました。サーバー構成を確認してください。
ko: 인가 URL을 생성하지 못했습니다。 서버 구성을 확인하세요。
nb: Kunne ikke bygge autorisasjons-URL. Kontroller serverkonfigurasjonen.
nl: Autorisatie-URL kon niet worden opgebouwd. Controleer de serverconfiguratie.
pl: Nie udało się utworzyć adresu URL autoryzacji. Sprawdź konfigurację serwera.
pt: Falha ao criar a URL de autorização. Verifique a configuração do servidor.
ru: Не удалось сформировать URL авторизации. Проверьте конфигурацию сервера.
sv: Det gick inte att skapa auktoriseringsadressen. Kontrollera serverkonfigurationen.
th: ไม่สามารถสร้าง URL สำหรับการยืนยันตัวตนได้ โปรดตรวจสอบการตั้งค่าเซิร์ฟเวอร์
tr: Yetkilendirme URL’si oluşturulamadı. Lütfen sunucu yapılandırmasını kontrol edin.
vi: Không thể tạo URL ủy quyền. Vui lòng kiểm tra cấu hình máy chủ.
zh_hans: 无法构建授权地址，请检查服务器配置
zh_hant: 無法建立授權位址，請檢查伺服器設定

# yggdrasil.error.invalid_callback_url
source: Callback URL is invalid.
ar: رابط الرجوع غير صالح.
da: Tilbagekaldelses-URL'en er ugyldig.
de: Die Rückruf-URL ist ungültig.
es: La URL de retorno no es válida.
fi: Paluukutsuosoite on virheellinen.
fr: L’URL de rappel est invalide.
hi: कॉलबैक URL अमान्य है।
it: L’URL di callback non è valida.
ja: コールバックURLが無効です。
ko: 콜백 URL이 올바르지 않습니다。
nb: Tilbakekallings-URL-en er ugyldig.
nl: De callback-URL is ongeldig.
pl: Adres URL wywołania zwrotnego jest nieprawidłowy.
pt: O URL de callback é inválido.
ru: Недопустимый URL-адрес обратного вызова.
sv: Återuppringningsadressen är ogiltig.
th: URL การเรียกกลับไม่ถูกต้อง
tr: Geri çağırma URL’si geçersiz.
vi: URL gọi lại không hợp lệ.
zh_hans: 回调地址无效
zh_hant: 回呼位址無效

# yggdrasil.error.login_failed_retry
source: Sign-in failed. Please try again later.
ar: فشل تسجيل الدخول. يرجى المحاولة مرة أخرى لاحقًا.
da: Login mislykkedes. Prøv igen senere.
de: Anmeldung fehlgeschlagen. Bitte versuche es später erneut.
es: Error al iniciar sesión. Inténtalo de nuevo más tarde.
fi: Kirjautuminen epäonnistui. Yritä myöhemmin uudelleen.
fr: Échec de la connexion. Veuillez réessayer plus tard.
hi: साइन-इन विफल रहा। कृपया बाद में पुनः प्रयास करें।
it: Accesso non riuscito. Riprova più tardi.
ja: サインインに失敗しました。しばらくしてからもう一度お試しください。
ko: 로그인에 실패했습니다。 나중에 다시 시도해 주세요。
nb: Innlogging mislyktes. Prøv igjen senere.
nl: Aanmelden is mislukt. Probeer het later opnieuw.
pl: Logowanie nie powiodło się. Spróbuj ponownie później.
pt: Falha ao iniciar sessão. Tente novamente mais tarde.
ru: Ошибка входа. Попробуйте позже.
sv: Inloggning misslyckades. Försök igen senare.
th: ลงชื่อเข้าใช้ไม่สำเร็จ โปรดลองอีกครั้งในภายหลัง
tr: Oturum açma başarısız oldu. Lütfen daha sonra tekrar deneyin.
vi: Đăng nhập thất bại. Vui lòng thử lại sau.
zh_hans: 登录失败，请稍后重试
zh_hant: 登入失敗，請稍後再試

# yggdrasil.error.no_auth_code
source: No authorization code was received.
ar: لم يتم تلقي رمز تفويض.
da: Ingen autorisationskode blev modtaget.
de: Es wurde kein Authentifizierungscode empfangen.
es: No se recibió ningún código de autorización.
fi: Valtuutuskoodia ei vastaanotettu.
fr: Aucun code d’autorisation n’a été reçu.
hi: कोई प्राधिकरण कोड प्राप्त नहीं हुआ।
it: Nessun codice di autorizzazione ricevuto.
ja: 認可コードを受信できませんでした。
ko: 인가 코드를 받지 못했습니다。
nb: Ingen autorisasjonskode ble mottatt.
nl: Er is geen autorisatiecode ontvangen.
pl: Nie otrzymano żadnego kodu autoryzacji.
pt: Nenhum código de autorização foi recebido.
ru: Код авторизации не получен.
sv: Ingen auktoriseringskod togs emot.
th: ไม่ได้รับรหัสอนุญาต
tr: Herhangi bir yetkilendirme kodu alınmadı.
vi: Không nhận được mã ủy quyền nào.
zh_hans: 未获取到授权码
zh_hant: 未取得授權碼

# yggdrasil.error.password_empty
source: Please enter your password
ar: يرجى إدخال كلمة المرور
da: Indtast din adgangskode
de: Bitte Passwort eingeben
es: Introduce tu contraseña
fi: Syötä salasana
fr: Veuillez saisir votre mot de passe
hi: कृपया पासवर्ड दर्ज करें
it: Inserisci la password
ja: パスワードを入力してください
ko: 비밀번호를 입력하세요
nb: Skriv inn passordet
nl: Voer je wachtwoord in
pl: Wprowadź hasło
pt: Digite sua senha
ru: Введите пароль
sv: Ange ditt lösenord
th: กรุณาใส่รหัสผ่าน
tr: Lütfen parolanızı girin
vi: Vui lòng nhập mật khẩu
zh_hans: 请输入密码
zh_hant: 請輸入密碼

# yggdrasil.error.password_unsupported
source: This server does not support password login
ar: هذا الخادم لا يدعم تسجيل الدخول بكلمة المرور
da: Denne server understøtter ikke adgangskodelogin
de: Dieser Server unterstützt keine Passwortanmeldung
es: Este servidor no admite inicio de sesión con contraseña
fi: Tämä palvelin ei tue salasanakirjautumista
fr: Ce serveur ne prend pas en charge la connexion par mot de passe
hi: यह सर्वर पासवर्ड लॉगिन का समर्थन नहीं करता
it: Questo server non supporta l’accesso con password
ja: このサーバーはパスワードログインに対応していません
ko: 이 서버는 비밀번호 로그인을 지원하지 않습니다
nb: Denne serveren støtter ikke passordpålogging
nl: Deze server ondersteunt geen wachtwoordlogin
pl: Ten serwer nie obsługuje logowania hasłem
pt: Este servidor não suporta login por senha
ru: Этот сервер не поддерживает вход по паролю
sv: Den här servern stöder inte lösenordsinloggning
th: เซิร์ฟเวอร์นี้ไม่รองรับการเข้าสู่ระบบด้วยรหัสผ่าน
tr: Bu sunucu parola ile girişi desteklemiyor
vi: Máy chủ này không hỗ trợ đăng nhập bằng mật khẩu
zh_hans: 此服务器不支持用户名密码登录
zh_hant: 此伺服器不支援使用者名稱密碼登入

# yggdrasil.error.server_not_selected
source: No Yggdrasil server selected.
ar: لم يتم اختيار خادم Yggdrasil.
da: Ingen Yggdrasil-server er valgt.
de: Es wurde kein Yggdrasil-Server ausgewählt.
es: No se ha seleccionado ningún servidor Yggdrasil.
fi: Yhtään Yggdrasil-palvelinta ei ole valittu.
fr: Aucun serveur Yggdrasil n’est sélectionné.
hi: कोई Yggdrasil सर्वर चयनित नहीं है।
it: Nessun server Yggdrasil selezionato.
ja: Yggdrasilサーバーが選択されていません。
ko: 선택된 Yggdrasil 서버가 없습니다。
nb: Ingen Yggdrasil-server er valgt.
nl: Er is geen Yggdrasil-server geselecteerd.
pl: Nie wybrano żadnego serwera Yggdrasil.
pt: Nenhum servidor Yggdrasil foi selecionado.
ru: Сервер Yggdrasil не выбран.
sv: Ingen Yggdrasil-server har valts.
th: ยังไม่ได้เลือกเซิร์ฟเวอร์ Yggdrasil
tr: Herhangi bir Yggdrasil sunucusu seçilmedi.
vi: Chưa chọn máy chủ Yggdrasil nào.
zh_hans: 未选择Yggdrasil服务器
zh_hant: 未選擇Yggdrasil伺服器

# yggdrasil.server.picker
source: Skin server
ar: خادم الشكل
es: Servidor de skins
fi: Skini-palvelin
fr: Serveur de skins
hi: स्किन सर्वर
it: Server delle skin
ja: スキンサーバー
ko: 스킨 서버
pl: Serwer skórek
pt: Servidor de skins
ru: Сервер скинов
th: เซิร์ฟเวอร์สกิน
tr: Skin sunucusu
vi: Máy chủ skin
zh_hans: 皮肤站
zh_hant: 皮膚站

# yggdrasil.server.please_select
source: No preset selected (choose when adding a player)
ar: يرجى اختيار خادم الجلد
da: Vælg venligst en skinsserver
de: Bitte wählen Sie einen Skin-Server aus
es: Por favor selecciona un servidor de skins
fi: Valitse skini-palvelin
fr: Veuillez sélectionner un serveur de skins
hi: कृपया एक स्किन सर्वर चुनें
it: Seleziona un server delle skin
ja: スキンサーバーを選択してください
ko: 스킨 서버를 선택하세요
nb: Velg en skin-server
nl: Selecteer een skinserver
pl: Wybierz serwer skórek
pt: Selecione um servidor de skins
ru: Выберите сервер скинов
sv: Välj en skinserver
th: โปรดเลือกเซิร์ฟเวอร์สกิน
tr: Lütfen bir skin sunucusu seçin
vi: Vui lòng chọn một máy chủ skin
zh_hans: 未预选
zh_hant: 未預選
